import DiscountTabs from "../../components/DiscountTabs/DiscountTabs";
import PagePath from "../../components/PagePath/PagePath";
import HeadInfo from "../../utils/HeadInfo";

import styles from './offer.module.scss'

const OfferPage = () => {
    return (
        <>
            <HeadInfo title="Оферта" />
            <main className={styles.container}>
                <PagePath
                    paths={[
                        {
                            "url": "/",
                            "name": "Главная"
                        },
                        {
                            "url": "",
                            "name": `Оферта`
                        }
                    ]}
                />
                <h1>Оферта</h1>
                <div className={styles.information}>
                    <p>Публичная оферта интернет-магазина «110volt.uz»</p>
                    <p>
                        Внимательно ознакомьтесь с текстом публичной оферты, если Вы не согласны с каким-либо пунктом оферты, Вы вправе отказаться от покупки Товаров, предоставляемых Продавцом, и не совершать действий указанной в п. 3.1. настоящей Оферты.
                    </p>

                    <p>
                        Настоящая публичная Оферта (далее по тексту — Договор) является официальным предложением ЧП «Nasirov Akmal Axrorovich» (далее по тексту — Продавец) в адрес любого физического или юридического лица, обладающего дееспособностью и необходимым полномочием заключить с Продавцом договор купли-продажи Товара на условиях, определенных в настоящей оферте и содержит все существенные условия договора.
                    </p>


                    <p>
                        1.1. Оферта разработана в соответствии с Гражданским кодексом Республики Узбекистан, с законами Республики Узбекистан &quot;Об электронной коммерции&quot;, &quot;Об электронном документообороте&quot; и другими нормативно-правовыми актами регламентируют осуществление реализации товаров (работ, услуг) в форме электронной коммерции, представленный в официальном Интернет-магазине продавца по веб адресу: www.110volt.uz
                    </p>
                    <p>

                        1.2. Розничная торговля, осуществляемая в форме электронной коммерции, регламентируется Правилами розничной торговли в Республике Узбекистан, утвержденным постановлением Кабинета Министров Республики Узбекистан от 13 февраля 2003 г. за № 75 и Правилами осуществления электронной коммерции, утвержденным постановлением Кабинета Министров Республики Узбекистан от 02 июня 2016 г. за № 185.
                    </p>

                    <p>
                        1.3. Отношения в области защиты прав потребителей регулируются Гражданским кодексом Республики Узбекистан, Законом Республики Узбекистан «О защите прав потребителей» от 26 апреля 1996 года. за №221-I и другими нормативно-правовыми актами Республики Узбекистан.
                    </p>
                </div>
                <DiscountTabs />
            </main>
        </>
    )
}

export default OfferPage;