import { useState } from 'react';
import styles from './CompanyDescription.module.scss';

const CompanyDescription = ({ title, description, link }) => {
    const [isHidden, setIsHidden] = useState(true);
    return (
        <article className={styles.container}>
            <h1>110volt – современный интернет-магазин бытовой техники, электроники и инновационных гаджетов</h1>

            <div className={isHidden ? `${styles.hide}` : null}>
                <p>Интернет-магазин 110-volt.uz регулярно проводит масштабные распродажи. В рамках таких акций предоставляются большие скидки (до 95%) на одежду, обувь, детские товары. Условия распродаж распространяются и на электронику, продукты питания, товары для дома, книги и многое другое. Чтобы быть в курсе предстоящих скидок или появления в ассортименте новых моделей от любимых брендов, достаточно подписаться на email-рассылку. Интернет-магазин одежды своевременно информирует получателей рассылки о распродажах, обновлении ассортимента. Дополнительные выгодные условия действуют для постоянных покупателей Wildberries – персональная скидка, зависящая от процента выкупа вещей. В Wildberries всегда ответственно подходят к выбору поставщиков, со многими производителями мы работаем напрямую, поэтому все категории товаров отличаются высоким качеством, разнообразием моделей и цветов, доступными ценами.</p>

                <p>Доставка и оплата без проблем</p>

                <p>Онлайн-магазин 110-volt.uz осуществляет бесплатную доставку по всей России с пом  ощью собственной курьерской службы. Покупатель может также забрать заказ из пункта выдачи заказов. Любую одежду, обувь и другие товары можно примерить перед оплатой заказа курьеру или в пункте выдачи заказа, оборудованном удобными примерочными.</p>

                <p>110-volt.uz предлагает несколько различных вариантов оплаты заказа как при оформлении, так и по факту при получении, - банковской картой или переводом, наличным расчетом или электронным платежом. Если товар не подошел, его можно вернуть с курьером как до оплаты заказа, так и после по почте или в одном из 7000 пунктов выдачи заказа в течение 21 дня.</p>

                <p>Покупки всегда и везде</p>

                <p>Купить одежду, обувь, аксессуары, детские товары и товары для дома в Wildberries можно быстро и просто. Удобный вариант - покупки через специальное мобильное приложение. Его можно скачать и установить на любой смартфон. В мобильном приложении можно заказать и другие доступные товары - электронику, продукты питания, книги.</p>

                <p> Задать интересующий вопрос можно в любое время – наш call-центр работает 24/7.</p>

                <p>Начни прямо сейчас!
                    Чтобы начать шопинг с Wildberries – необходимо пройти простую регистрацию на сайте, которая займет всего несколько минут. Оцените преимущества покупок одежды, обуви, электроники, детских товаров и продукции для дома, продуктов питания и книг в Wildberries уже сейчас.</p>
            </div>
            <div>
                <button onClick={() => { setIsHidden(!isHidden) }}>
                    {
                        isHidden ? 'Читать далее' : 'Скрыть'
                    }
                </button>
            </div>
        </article>
    )
}

export default CompanyDescription;